tap "b4b4r07/tap"
tap "candid82/brew"
tap "delphinus/sfmono-square"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "yqrashawn/goku"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Manage compile and link flags for libraries
brew "pkg-config"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU awk utility
brew "gawk"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Network authentication protocol
brew "krb5"
# Pager program similar to more
brew "less"
# BSD-style licensed readline alternative
brew "libedit"
# Conversion library
brew "libiconv"
# NaCl networking and cryptography library
brew "libsodium"
# GNOME XML library
brew "libxml2"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Regular expressions library
brew "oniguruma"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# Object-relational database system
brew "postgresql"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Version control system designed to be a better CVS
brew "subversion"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Command-line interface for WordPress
brew "wp-cli"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Replacement for UNIX rm command!
brew "b4b4r07/tap/gomi"
# Square-sized SF Mono + Japanese fonts + nerd-fonts
brew "delphinus/sfmono-square/sfmono-square"
# karabiner configurator
brew "yqrashawn/goku/goku"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
cask "aquaskk"
# Trains AIs to understand and translate texts
cask "deepl"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
cask "font-daddy-time-mono-nerd-font"
# Floating screenshot like a sticky
cask "fuwari"
# Web browser
cask "google-chrome"
cask "google-japanese-ime"
cask "gyazo"
# Keyboard customizer
cask "karabiner-elements"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# WordPress local development tool by Flywheel
cask "local"
# Screen capture tool with mark up and sharing features
cask "skitch"
# Team communication and collaboration software
cask "slack"
# Video communication and virtual meeting platform
cask "zoom"
mas "Magnet", id: 441258766
mas "Spark", id: 1176895641
